"use strict"

'number' + 3 + 3  // 'number' є рядком  // тому буде конкатенація рядків/ тобто результат буде рядком 'number33' 
// .тобто спочатку 'mumber' + 3 = 'number3', а потім 'number3' + 3 = 'number33'

null + 3 /* null + 3 = 3, оскільки нуль перетворюється на 0 -число  при арифметичних операціях, то тоді ми отримаємо 0 + 3 = 3 */

5 && "qwerty" /* 5 - це істинне значення, тому результатом буде "qwerty", оскільки  && повертає 
останнє істинне значення, якщо всі операнди істинні. Якщо перший операнд хибний, то повертається він. */

+'40' + +'2' + "hillel";  /*  + '40' перетворює рядок '40' на число 40, + '2' перетворює рядок '2' на число 2, 
а потім конкатенація з рядком "hillel" дає результат "42hillel" */

'10' - 5 === 6; /* '10' - 5 = 5, то оскільки при арифмет. операціях рядок '10' перетворюється на число 10, потім 10 - 5 = 5,
і 5 === 6 - це хибне твердження, тому результат буде false*/    

true + false //в джаваскріпт true перетворюється на 1, а false на 0, тому true + false = 1 + 0 = 1 , оскільки це арифметична операція, результат буде числом 1

'4px' - 3 // '4px' не може бути перетворено на число, тому результат буде NaN (не намбер), оскільки джаваскріпт не може 
// виконати арифметичну операцію з рядком, який містить нечислові символи.

'4' - 3 // '4' - 3 = 1, оскільки рядок '4' перетворюється на число 4, і потім виконується арифметична операція 4 - 3 = 1 .висновок якщо 
//хочемо виконати арифметичну операцію з рядком, то він має бути числом, тобто містити лише цифри, а не всякі там букви чи символди

'6' + 3 ** 0; // '6' + 3 ** 0 = '6' + 1 = '61', оскільки 3 ** 0 = 1, а потім виконується конкатенація рядка '6' з числом 1,
// що дає результат '61'. Тобто якщо ми маємо рядок і число  то при конкатенації результат буде рядком, а не числом.

12 / '6' // 12 / '6' = 2, оскільки рядок '6' перетворюється на число 6, і потім виконується ділення 12 / 6 = 2. 

'10' + (5 === 6); // '10' + false = '10false', оскільки 5 === 6 - це хибне твердження, і при конкатенації рядка '10' з булевим значенням false, 
// результат буде рядком '10false', тобто при конкатенації рядка з булевим значенням, булеве значення перетворюється на рядок.

null == '' /// false, оскільки null і '' (порожній рядок) не є рівними значеннями 
// '' - це порожній рядок, який є рядком з нульовою довжиною.

3 ** (9 / 3); // 3 ** (9 / 3) = 3 ** 3 = 27, оскільки 9 / 3 = 3,//
//  і потім виконується піднесення до степеня 3 ** 3 = 27. п.с. дякую за нагадування про ступені

!!'false' == !!'true' // true,!! — це просто подвійне заперечення відповідно 'false' і 'true' обидва є рядками, які не є порожніми,
// тому вони обидва перетворюються на true при логічному запереченні !! .
// а при логічному запереченні !! вони обидва перетворюються на true.

0 || '0' && 1 // '0' && 1 = 1, оскільки '0' є істинним значенням (не порожній рядок),
// а 1 також є істинним значенням, тому результатом буде 1  

(+null == false) < 1; // true, оскільки +null перетворює null на 0, і 0 == false - це істинне твердження,
// а 0 < 1 - також істинне твердження, тому результат буде true

false && true || true // true, оскільки false && true = false, а потім false || true = true,
// тобто спочатку виконується логічне І (&&), а потім логічне АБО (||), що дає результат true.


false && (false || true);   // false, оскільки false && (false || true) = false && true = false,
// тобто спочатку виконується логічне АБО (||), а потім логічне І (&&), що дає результат false  

(+null == false) < 1 ** 5; // true, оскільки +null перетворює null на 0, і 0 == false - це істинне твердження,
// а 0 < 1 ** 5 - також істинне твердження, // оскільки 1 ** 5 = 1, тому результат буде true  